# Написать функцию morse, которая расшифровывает строку, закодированную азбукой Морзе
# a .-      h ....    o ---     u ..-      1 .----     6 -....
# b -...    i ..      p .--.    v ...-     2 ..---     7 --...
# c -.-.    j .---    q --.-    w .--      3 ...--     8 ---..
# d -..     k -.-     r .-.     x -..-     4 ....-     9 ----.
# e .       l .-..    s ...     y -.--     5 .....     0 -----
# f ..-.    m --      t -       z --..
# g --.     n -.
#
# Пример:
# morse("..  .- --  .-  - . ... -") ==> "i am a test"


import traceback


def morse(text):
    morse_decode = {
        ".-": "a",
        "-...": "b",
        "-.-.": "c",
        "-..": "d",
        ".": "e",
        "..-.": "f",
        "--.": "g",
        "....": "h",
        "..": "i",
        ".---": "j",
        "-.-": "k",
        ".-..": "l",
        "--": "m",
        "-.": "n",
        "---": "o",
        ".--.": "p",
        "--.-": "q",
        ".-.": "r",
        "...": "s",
        "-": "t",
        "..-": "u",
        "...-": "v",
        ".--": "w",
        "-..-": "x",
        "-.--": "y",
        "--..": "z",
        ".----": "1",
        "..---": "2",
        "...--": "3",
        "....-": "4",
        ".....": "5",
        "-....": "6",
        "--...": "7",
        "---..": "8",
        "----.": "9",
        "-----": "0",
        "_": " ",
    }

    decoded_text = [
        morse_decode[word] for word in text.replace("  ", " _ ").split()
    ]
    return "".join(decoded_text)


# Тесты
try:
    assert morse(".... . .-.. .-.. ---  .-- --- .-. .-.. -..") == "hello world"
    assert morse(".---- ... -  .- -. -..  ..--- -. -..") == "1st and 2nd"
    assert (
        morse(
            ".- -... -.-. -.. . ..-. --. .... .. .--- -.- .-.. -- -. --- .--. --.- .-. ... - ..- ...- .-- -..- -.-- --.. ----- .---- ..--- ...-- ....- ..... -.... --... ---.. ----."
        )
        == "abcdefghijklmnopqrstuvwxyz0123456789"
    )
    assert morse("") == ""
except AssertionError:
    print("TEST ERROR")
    traceback.print_exc()
else:
    print("TEST PASSED")
